#include <stdio.h>                          // นำเข้า libary Stdio.h (Starndard Input Output Header) มาใช้งานฟังก์ชั่น input,output

int main() {                                // สร้างฟังก์ชั่นหลักของโปรแกรม เพื่อเป็นจุดเริ่มต้นการทำงานเมื่อรันโปรแกรม

    char name[3];                           // สร้างตัวแปร name โดยใช้ char เนื่องจากต้องการรับค่า ตัวอักษรตัวแรกของชื่อ และใช้ Array เพื่อรับค่าของทั้ง 3 คนโดยที่ใช้ตัวแปรเดียว
    int age[3];                             // สร้างตัวแปร age โดยใช้ int เนื่องจากต้องการรับค่า อายุ เป็นเลขจำนวนเต็ม และใช้ Array เพื่อรับค่าของทั้ง 3 คนโดยที่ใช้ตัวแปรเดียว
    float height[3], weight[3];             // สร้างตัวแปร height และ weight โดยใช้ float เนื่องจากต้องการรับค่า ส่วนสูง และ น้ำหนักเ ป็นทศนิยม และใช้ Array เพื่อรับค่าของทั้ง 3 คนโดยที่ใช้ตัวแปรเดียว
    char grade[3];                          // สร้างตัวแปร grade โดยใช้ char เนื่องจากต้องการรับค่า ตัวอักษรของระดับเกรดที่ได้ และใช้ Array เพื่อรับค่าของทั้ง 3 คนโดยที่ใช้ตัวแปรเดียว

    for (int i = 0; i < 3; i++) {           // ใช้ For Loop เพื่อรับค่าข้อมูลโดยหาก i มากกว่าหรือเท่ากับ 3 ให้สิ้นสุดการ loop 
        
        printf("Enter name, age, height(cm), weight(kg), grade for person %d: ", i + 1);  // แสดงข้อวามเพื่อให้ใส่ input ข้อมูลที่ละคน และ i + 1 ทุกครั้งเมื่อเริ่มทำคำสั่งใน loop 
        scanf(" %c %d %f %f %c", &name[i], &age[i], &height[i], &weight[i], &grade[i]);   // โดยให้ใส่ อักษรตัวแรกของชื่อ, อายุเป็นจำนวนเต็ม, ส่วนสูงเป็นทศนิยม, น้ำหนักเป็นทศนิยม, เกรดเป็นตัวอักษร

    }

    printf("+--------+-----+------------+------------+------------+\n");    //
    printf("| Name   | Age | Height(cm) | Weight(kg) | Grade Code |\n");    // สร้างหัวตารางสำหรับทำตารางสรุปผล
    printf("+--------+-----+------------+------------+------------+\n");    //

    for (int i = 0; i < 3; i++) {           // ใช้ For Loop โดยกำหนกให้ i = 0และหาก i มากกว่าหรือเท่ากับ 3 ให้สิ้นสุดการ loop 
        
        printf("| %-6c | %3d | %10.1f | %10.1f | %10c |\n",         
            name[i], age[i], height[i], weight[i], grade[i]);       
        // สร้างตารางชื่อให้มีขนาด 6 ช่องแสดงผลเป็นตัวอักษรและชิดไปทางซ้าย, สร้างตารางอายุให้มีขนาด 3 ช่องโดยแสดงผลเป็นตัวเลขและให้ชิดขวา, สร้างตารางส่วนสูงขนาด 10 ช่องโดยแสดงผลเป็นทศนิยม 1 ตำแหน่งและให้ชิดขวา
        // สร้างตารางน้ำหนักขนาด 10 ช่องโดยแสดงผลเป็นทศนิยม 1 ตำแหน่งและให้ชิดขวาม, สร้างตารางเกรดให้มีขนาด 10 ช่องแสดงผลเป็นตัวอักษรและชิดไปทางขวา
        // โดยในตารางแสดงผลจะแสดงผลชุดข้อมมูลที i = 0 ขึ้นมาและเมื่อแดงผลเสร็จจะ แสดงชุดข้อมมูลที่ i = 1 ออกมาและเมื่อแสดงผลเสร็จจะแสดงชุดข้อมูที่ i = 2 ออกมา และจะทำการปิดท้ายตารางสรุปผล

    }

    printf("+--------+-----+------------+------------+------------+\n");    // สร้างท้ายตารางเพื่อทำตารางสรุปผล

    return 0;                               // ทำการ reset ค่าของ code เพื่อสิ้นสุดกระบวนการ
}