#include <stdio.h>                                             // นำเข้า libary Stdio.h (Starndard Input Output Header) มาใช้งานฟังก์ชั่น input,output

int main() {                                                   // สร้างฟังก์ชั่นหลักของโปรแกรม เพื่อเป็นจุดเริ่มต้นการทำงานเมื่อรันโปรแกรม
    char name = 'K';                                           // ประกาศตัวแปร name โดยกำหนดค่าเป็นตัวอักษรแรกของชื่อจริง (ใช้ char เนื่องจากต้องการเประกาศค่าตัวแปรเป็นตัวอักษรตัวเดียว)
    int age = 17;                                              // ประกาศตัวแปร age โดยกำหนดค่าเป็นตัวเลขจำนวนเต็ม (ใช้ int เนื่องจากค่าตัวแปรต้องการประกาศเป็น เลขจำนวนเต็ม)
    float weight = 76.67;                                      // ประกาศตัวแปร weight โดยกำหนดค่าเป็นทศนิยมไม่เกิน (ใช้ Float เนื่องจากเป็นค่าที่กำหนดทศนิยมไม่เกิน 6 ตำแหน่ง)

    printf("Student %c is %d years old.\n", name, age);        // แสดงข้อความ "Student (โดยแสดงตัวแปร name) is (และแสดงตัวแปร age) years old." และตัดขึ้นบรรทัดใหม่
    printf("His weighs is %.1f kg.\n", weight);                // แสดงข้อความ "His weighs is (โดยแสดงตัวแปร weight) kg."

    return 0;                                                  // ทำการ reset ค่าของ code เพื่อสิ้นสุดกระบวนการ
}
